оперативныйучет2/src/Documents/оуп_СтрокаОтчетаПроизводстваВыпускПодукции/оуп_СтрокаОтчетаПроизводстваВыпускПодукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_СтрокаОтчетаПроизводстваВыпускПодукции</name>
  <registerRecords>AccumulationRegister.оуп_ДанныеВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.оуп_ПартииВыпускаПродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

оперативныйучет2/src/AccumulationRegisters/оуп_ДанныеВыпускаПродукции/оуп_ДанныеВыпускаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>оуп_ДанныеВыпускаПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

оперативныйучет2/src/AccumulationRegisters/оуп_ПартииВыпускаПродукции/оуп_ПартииВыпускаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>оуп_ПартииВыпускаПродукции</name>
  <resources>
    <name>КоличествоВыпуск</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

оперативныйучет2/src/Documents/оуп_СтрокаОтчетаПроизводстваВыпускПодукции/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ПрограммныйИнтерфейс
//
//
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Попытка
		ДобавитьДвижениеПриход();
//		текОперация_ПартииВыпуска_Успешна = ПроверитьОстаток_ПартииВыпуска();
//		текОперация_ДанныеВыпуска_Успешна = ПроверитьОстатокДанныеВыпуска();
		
//		если не текОперация_ПартииВыпуска_Успешна или не текОперация_ДанныеВыпуска_Успешна Тогда
//			ВызватьИсключение "При выполнении операции нарушен баланс остатков !"
//				
//		КонецЕсли;
		
		
	Исключение
		// TODO:
		Отказ = Истина;
		сообщение = новый СообщениеПользователю();
		Сообщение.Текст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		сообщение.Сообщить();
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДвижениеПриход()
	// регистр оуп_ДанныеВыпускаПродукции
	Движения.оуп_ДанныеВыпускаПродукции.Записывать = Истина;
	Движение = Движения.оуп_ДанныеВыпускаПродукции.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ДатаСмены = ДатаСмены;
	Движение.Спецификация = Спецификация;
	Движение.Номенклатура = Номенклатура;
	Движение.Склад = Склад;
	Движение.СкладПолучатель = СкладПолучатель;
	Движение.Количество = Количество;

	// регистр оуп_ПартииВыпускаПродукции
	Движения.оуп_ПартииВыпускаПродукции.Записывать = Истина;
	Движение = Движения.оуп_ПартииВыпускаПродукции.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ДатаСмены = ДатаСмены;
	Движение.Спецификация = Спецификация;
	Движение.Склад = Склад;
	Движение.КоличествоВыпуск = Количество;
КонецПроцедуры

Функция ПроверитьОстаток_ПартииВыпуска()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	оуп_ПартииВыпускаПродукцииОстатки.ДатаСмены,
		|	оуп_ПартииВыпускаПродукцииОстатки.Спецификация,
		|	оуп_ПартииВыпускаПродукцииОстатки.Склад,
		|	оуп_ПартииВыпускаПродукцииОстатки.КоличествоВыпускОстаток,
		|	оуп_ПартииВыпускаПродукцииОстатки.КоличествоСырьеОстаток
		|ИЗ
		|	РегистрНакопления.оуп_ПартииВыпускаПродукции.Остатки(, ДатаСмены = &ДатаСмены
		|	И Спецификация = &Спецификация
		|	И Склад = &Склад) КАК оуп_ПартииВыпускаПродукцииОстатки
		|ГДЕ
		|	оуп_ПартииВыпускаПродукцииОстатки.КоличествоВыпускОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	если РезультатЗапроса.Пустой() Тогда
		возврат истина;
	иначе 
		возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьОстатокДанныеВыпуска()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	оуп_ДанныеВыпускаПродукцииОстатки.ДатаСмены,
		|	оуп_ДанныеВыпускаПродукцииОстатки.Спецификация,
		|	оуп_ДанныеВыпускаПродукцииОстатки.Номенклатура,
		|	оуп_ДанныеВыпускаПродукцииОстатки.Склад,
		|	оуп_ДанныеВыпускаПродукцииОстатки.СкладПолучатель,
		|	оуп_ДанныеВыпускаПродукцииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.оуп_ДанныеВыпускаПродукции.Остатки(, ДатаСмены = &ДатаСмены
		|	И Спецификация = &Спецификация
		|	И Номенклатура = &Номенклатура
		|	И Склад = &Склад
		|	И СкладПолучатель = &СкладПолучатель) КАК оуп_ДанныеВыпускаПродукцииОстатки
		|ГДЕ
		|	оуп_ДанныеВыпускаПродукцииОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти

#КонецЕсли
